{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1000"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_9/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_9/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_9/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_9/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_10/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_10/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_10/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_11/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_11/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_11/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_12/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_12/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad/paddings", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_137", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_138", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad", "op": "Pad", "input": ["input_1", "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad", "StatefulPartitionedCall/mobilenet_0.25_224/conv1/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv1_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_2/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_2/Pad", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_4/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_4/Pad", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_6/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_6/Pad", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_8_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_8/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_9/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_8_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_9/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_9/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_9_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_9/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_9/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_10/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_9_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_10/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_10/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_10_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_10/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_10/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_11/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_10_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_11/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_11/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_11_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_11/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_11/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_12/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_11_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_12/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pad_12/Pad", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_12/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_12/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_12/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13/Conv2D_weights", "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/global_average_pooling2d_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13_relu/Relu6", "StatefulPartitionedCall/mobilenet_0.25_224/global_average_pooling2d_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/global_average_pooling2d_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Shape", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/global_average_pooling2d_1/Mean", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_preds/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/Reshape", "Func/StatefulPartitionedCall/input/_137", "Func/StatefulPartitionedCall/input/_138"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_preds/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Shape", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_1/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/strided_slice", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/conv_preds/BiasAdd", "StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/act_softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/reshape_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/mobilenet_0.25_224/act_softmax/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1/Conv2D_weights", "shape": [3, 3, 3, 8], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -37.17271924282617, "scale": 0.0008767150764817493, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv1/Conv2D_bn_offset", "shape": [8], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.3890710639437013, "scale": 6.0452309500264335e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12/Conv2D_weights", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -4.26321867307391, "scale": 8.840450134940922e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise_weights", "shape": [3, 3, 8, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -26.729089554891235, "scale": 0.0005051802977677421, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_1/depthwise_bn_offset", "shape": [8], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.7311562518283306, "scale": 0.00012975266225879868, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1/Conv2D_weights", "shape": [1, 1, 8, 16], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -2.2941199108111268, "scale": 0.00012230088020104098, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_1/Conv2D_bn_offset", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -8.955091031799876, "scale": 0.00024160504604882978, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_12/Conv2D_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -10.212274125828898, "scale": 0.00031832779919045224, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise_weights", "shape": [3, 3, 16, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -60.13960891342949, "scale": 0.0016635209369724908, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_2/depthwise_bn_offset", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -7.457492413283977, "scale": 0.00023548984505759684, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -4.263691717363053, "scale": 0.00017612738422682805, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_2/Conv2D_bn_offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -34.72916091985303, "scale": 0.0009943071724648714, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -18.05635481706571, "scale": 0.0014348660852722276, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_3/depthwise_bn_offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -4.924237937429563, "scale": 0.00022894913229633452, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3/Conv2D_weights", "shape": [1, 1, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -3.1181315945716763, "scale": 7.340061661852773e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -54.37483426722198, "scale": 0.001871187386600433, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_3/Conv2D_bn_offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -8.2178182144264, "scale": 0.0003234724744903129, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -4.192011514564596, "scale": 0.0001465379632455202, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_4/depthwise_bn_offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -6.006460088172656, "scale": 0.00022867814239597414, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4/Conv2D_weights", "shape": [1, 1, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.8685803781669328, "scale": 7.863733600567851e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_13/depthwise_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -6.96270626866591, "scale": 0.0002384080215259685, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_4/Conv2D_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -5.134829667027995, "scale": 0.0002981033188405222, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -3.799545956494707, "scale": 0.00013879112932841566, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_5/depthwise_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -15.920509707566628, "scale": 0.0003796925759018991, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5/Conv2D_weights", "shape": [1, 1, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -3.2487285533540353, "scale": 0.00011796828328385328, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_5/Conv2D_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -11.854302098082217, "scale": 0.00037378766784644686, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13/Conv2D_weights", "shape": [1, 1, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -10.973937374108296, "scale": 0.00029774364093953105, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -8.082197124806877, "scale": 0.0002648945339322499, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_6/depthwise_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -5.639010474763165, "scale": 0.00021318704301399435, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6/Conv2D_weights", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.6416194357842542, "scale": 5.1035858850471124e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_6/Conv2D_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -8.305710567216211, "scale": 0.00030199289412850274, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_13/Conv2D_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -49.15896339023596, "scale": 0.0015500713688035555, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -6.148438790781852, "scale": 0.0001971727797447921, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_7/depthwise_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -13.459607168319724, "scale": 0.0005462281225729363, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.7938586685098518, "scale": 2.6615437975989933e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_pw_7/Conv2D_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -4.923397454642828, "scale": 0.00017687793981113086, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -2.3535228297486137, "scale": 6.99703540774353e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/mobilenet_0.25_224/conv_dw_8/depthwise_bn_offset", "shape": [128], "dtype": "float32", "quantization": 